Block 1: Loading the libraries

In [2]:
import numpy as np
import pandas as pd

Block 2: reading csv, renaming columns, and printing head, tail, and describe

In [37]:
data = pd.read_csv('problem_set_1_data.csv')
data.columns = ['quiz_total','attended','final_grade','final_exam','name']
print(data.head())
print(data.tail())
data.describe()

   quiz_total  attended  final_grade  final_exam               name
0       78.50         1        99.38          46       Linnie Lietz
1       64.25         0        95.78          45      Mitch Mustain
2       76.75         0        97.42          41     Salina Chavera
3       69.00         1        92.50          38  Kimberely Conwell
4       64.00         0        92.50          39          Zack Burk
     quiz_total  attended  final_grade  final_exam                 name
166        73.5         0        96.25          45           Dana Malta
167        75.5         0        98.13          44         Sixta Heyden
168        41.0         0        69.38          32       Brianne Broome
169        77.0         0       101.25          47  Elouise Weatherholt
170        72.0         0        92.81          38        Addie Maharaj

       quiz_total    attended  final_grade  final_exam
count  171.000000  171.000000   171.000000  171.000000
mean    69.131579    0.192982    91.855380   39.672515
std      9.488473    0.395798     9.487795    5.511304
min      0.000000    0.000000     2.500000    0.000000
25%     65.500000    0.000000    89.380000   37.000000
50%     72.000000    0.000000    93.130000   40.000000
75%     75.500000    0.000000    96.360000   44.000000
max     79.500000    1.000000   104.380000   49.000000

Based on the averages, it looks like most people get about 70 points on the quiz, 40 points on the final, and have an average grade of 92% in the class. Also, only about 20% of people attended class.

Block 3: subsetting data

In [38]:
print('grades when students attended class') 
print(data[data['attended']==1].mean()) # this pulls out the data when attended is equal to 1

print('grades when students did not attend class')
print(data[data['attended']==0].mean()) # this pulls out the data when attended is equal to 0

grades when students attended class
quiz_total     72.500000
attended        1.000000
final_grade    95.072121
final_exam     40.636364
dtype: float64
grades when students did not attend class
quiz_total     68.326087
attended        0.000000
final_grade    91.086159
final_exam     39.442029
dtype: float64

Based on the averages when subsetting the data, it looks like most people have about 4 more points in their quizzes, 4% more points in their final grade, and about 1.5 points better in their final exam. These results suggest that going to class is a good idea!

EXTRA CREDIT:

Method 1: use a for loop, go through all of the names and spit out names when quiz_total, final_exam, and final_grade all match

In [41]:
for i in np.arange(0,len(data)):
  if sum((data['quiz_total'][i] == data['quiz_total']) & (data['final_exam'][i] == data['final_exam']) & (data['final_grade'][i] == data['final_grade'])) > 1:
    print(data['name'][i])

Jaraham Eidda
Addie Maharaj

Method 2: use duplicated with an input argument of false so that it spit out both names

In [50]:
data[data[['quiz_total','final_exam','final_grade']].duplicated(keep=False)]

     quiz_total  attended  final_grade  final_exam           name
146        72.0         0        92.81          38  Jaraham Eidda
170        72.0         0        92.81          38  Addie Maharaj

Method 2: This could be partial credit if they don't use the false input argument

In [53]:
data[data[['quiz_total','final_exam','final_grade']].duplicated()]

     quiz_total  attended  final_grade  final_exam           name
170        72.0         0        92.81          38  Addie Maharaj

Method 3: This could be partial credit if they just went to excel and found the names. Since that is pretty clever!

In [54]:
print('Addie Maharaj','Jaraham Eidda')

Addie Maharaj Jaraham Eidda